![Aula07capa.png](./figuras/Aula07capa.png)

In [57]:
import warnings
warnings.filterwarnings("ignore")

### Preparação.....

# 1. Mini Tutorial: Instalação do PostgreSQL

## O que é PostgreSQL?
PostgreSQL é um sistema de gerenciamento de banco de dados relacional avançado, open-source, com foco em extensibilidade e conformidade com padrões SQL.

---

## Passo a Passo para Instalação

### 1. Baixando o PostgreSQL
1. Acesse o site oficial do PostgreSQL: [https://www.postgresql.org/download/](https://www.postgresql.org/download/).
2. Escolha o sistema operacional adequado (Windows, macOS, Linux) e siga para a página de download.

---

### 2. Instalando no Windows
1. Baixe o **installer** correspondente ao seu sistema.
2. Execute o arquivo baixado e siga as etapas:
   - Escolha os componentes a instalar: **PostgreSQL Server**, **pgAdmin**, **Command Line Tools**.
   - Defina uma senha para o usuário `postgres`.
   - Escolha a porta (padrão: `5432`).
3. Finalize a instalação.

---

### 3. Instalando no Linux
#### Debian/Ubuntu
Execute os comandos abaixo no terminal:
```bash
sudo apt update
sudo apt install postgresql postgresql-contrib

#### Instalaçao Bibliotecas

In [4]:
!pip install psycopg2 pandas

Requirement already satisfied: psycopg2 in /home/hericson/anaconda3/envs/my_projects/lib/python3.9/site-packages (2.9.10)
Requirement already satisfied: pandas in /home/hericson/anaconda3/envs/my_projects/lib/python3.9/site-packages (2.0.1)
Requirement already satisfied: pytz>=2020.1 in /home/hericson/anaconda3/envs/my_projects/lib/python3.9/site-packages (from pandas) (2023.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/hericson/anaconda3/envs/my_projects/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: tzdata>=2022.1 in /home/hericson/anaconda3/envs/my_projects/lib/python3.9/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.20.3 in /home/hericson/anaconda3/envs/my_projects/lib/python3.9/site-packages (from pandas) (1.25.0)
Requirement already satisfied: six>=1.5 in /home/hericson/anaconda3/envs/my_projects/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

# 2. Introdução ao Banco de Dados

## O que é um Banco de Dados?
Um banco de dados é uma coleção organizada de dados. É amplamente utilizado para armazenar, recuperar e gerenciar informações.

### Componentes principais:
1. **Tabelas**: Estrutura que armazena dados em linhas e colunas.
2. **Chave Primária**: Identificador único para cada registro.
3. **Chave Estrangeira**: Conecta tabelas, criando relações.

### Relacionamentos:
- **1:1 (Um para Um)**: Exemplo: um funcionário e seu número de identificação.
- **1:N (Um para Muitos)**: Exemplo: um cliente pode fazer vários pedidos.
- **N:M (Muitos para Muitos)**: Exemplo: estudantes podem estar matriculados em vários cursos, e cursos podem ter vários estudantes.

Nesta aula, usaremos PostgreSQL para manipular um banco de dados que contém:
1. Clientes
2. Pedidos
3. Produtos
4. Detalhes dos pedidos

# 2.1 Criação de Banco de Dados e Tabelas

## Comandos DDL
Comandos de Data Definition Language (DDL) permitem criar e definir a estrutura do banco de dados. Os principais comandos são:
- `CREATE TABLE`: Cria uma tabela.
- `ALTER TABLE`: Modifica uma tabela existente.
- `DROP TABLE`: Remove uma tabela.

### Vamos criar tabelas para um sistema de gerenciamento de pedidos:
1. **Clientes**: Informações sobre os clientes.
2. **Pedidos**: Informações sobre os pedidos realizados.
3. **Produtos**: Produtos disponíveis para venda.
4. **DetalhesPedidos**: Detalhes de cada pedido (quantidade, produto, etc.).

# 2.2 Conexão com PostgreSQL

Vamos conectar ao PostgreSQL, criar um banco de dados chamado `auladb` e quatro tabelas: `Clientes` , `Produtos` , `Pedidos` , `DetalhesPedidos`.

In [1]:
import psycopg2

def execute_query(query, db_name='auladb'):
    # Conexão com PostgreSQL
    conn = psycopg2.connect(
        dbname=db_name, # nome do banco
        user="postgres",  # usuário de acesso
        password="userpassword",  # senha de acesso
        host="localhost", # endereço do servidor do banco de dados
        port="5432" # porta de acesso
    )
    conn.autocommit = True
    cursor = conn.cursor()

    cursor.execute(query)

    conn.close()

execute_query("DROP DATABASE IF EXISTS auladb", db_name='postgres')
execute_query("CREATE DATABASE auladb", db_name='postgres')


print("Banco de dados 'auladb' criado com sucesso!")

# Fechar a Conexao

Banco de dados 'auladb' criado com sucesso!

## 2.2.1 Diagrama de Entidade-Relacionamento

![ERD_diagram.png](./figuras/ERD_diagram.png)

# 2.3 Criação de Tabelas - Data Definition Language (DDL)

Vamos criar as tabelas `Clientes` , `Produtos` , `Pedidos` , `DetalhesPedidos`

In [2]:

# Criar tabelas no PostgreSQL
execute_query('''
CREATE TABLE Clientes (
    id_cliente SERIAL PRIMARY KEY,
    nome VARCHAR(100) NOT NULL,
    email VARCHAR(100) UNIQUE NOT NULL,
    telefone VARCHAR(15)
)
''')

execute_query('''
CREATE TABLE Produtos (
    id_produto SERIAL PRIMARY KEY,
    nome_produto VARCHAR(100) NOT NULL,
    preco DECIMAL(10, 2) NOT NULL
)
''')

execute_query('''
CREATE TABLE Pedidos (
    id_pedido SERIAL PRIMARY KEY,
    id_cliente INT NOT NULL,
    data_pedido DATE NOT NULL DEFAULT CURRENT_DATE,
    FOREIGN KEY (id_cliente) REFERENCES Clientes (id_cliente)
)
''')

execute_query('''
CREATE TABLE DetalhesPedidos (
    id_detalhe SERIAL PRIMARY KEY,
    id_pedido INT NOT NULL,
    id_produto INT NOT NULL,
    quantidade INT NOT NULL,
    FOREIGN KEY (id_pedido) REFERENCES Pedidos (id_pedido),
    FOREIGN KEY (id_produto) REFERENCES Produtos (id_produto)
)
''')

# conn.commit()
print("Tabelas criadas com sucesso!")
# conn.close()

Tabelas criadas com sucesso!

# 2.4 Inserção de Dados

## Comandos DML - Data Manipulation Language
Os comandos de Data Manipulation Language (DML) são usados para manipular dados no banco de dados. Exemplos:
- `INSERT INTO`: Insere novos dados.
- `UPDATE`: Atualiza dados existentes.
- `DELETE`: Remove dados.

Vamos adicionar dados fictícios às tabelas.

In [3]:
# Inserir dados fictícios diretamente por uma string sql
execute_query("INSERT INTO Clientes (nome, email, telefone) VALUES ('Joana', 'joanarabelo2013@gmail.com', '123456789')")
execute_query("INSERT INTO Clientes (nome, email, telefone) VALUES ('Renato', 'renatostanz@alu.ufc.br', '987654321')")
execute_query("INSERT INTO Clientes (nome, email, telefone) VALUES ('Natiara', 'natiarac@gmail.com', '987654321')")
execute_query("INSERT INTO Clientes (nome, email, telefone) VALUES ('Antonio', 'antvitoralmeida@gmail.com', '987654321')")

# conn.commit()
print('Dados inseridos com sucesso')
# conn.close()

Dados inseridos com sucesso

## Inserindo dados a partir de um dicionário

In [ ]:
# Inserir dados fictícios a partir de um dicionário

cliente = {'nome': 'Huan' , 'email': 'lilzzzhuan@gmail.com' , 'telefone': '(85)123456879'}

execute_query(f"INSERT INTO Clientes (nome, email, telefone) VALUES ('{cliente['nome']}', '{cliente['email']}', '{cliente['telefone']}')")

# print('Dados inseridos com sucesso')

## Inserindo dados a partir de um dataframe

In [43]:
import pandas as pd

nomes = ['Nivardo', 'Yago']
emails = ['nivardo2@gmail.com', 'yhagocastro91@gmail.com']
telefones = ['12341344', '345252542']

alunos_df = pd.DataFrame({'nome': nomes,
                   'email': emails,
                   'telefone': telefones})

alunos_df

      nome                    email   telefone
0  Nivardo       nivardo2@gmail.com   12341344
1     Yago  yhagocastro91@gmail.com  345252542

In [ ]:
# Percorrendo todos os valores do DF clientes
for idx, aluno in alunos_df.iterrows():
    execute_query(f"INSERT INTO Clientes (nome, email, telefone) VALUES ( '{aluno['nome']}' , '{aluno['email']}' , '{aluno['telefone']}')")

print('Dados inseridos com sucesso')

Dados inseridos com sucesso

## Inserindo alguns produtos

In [46]:
# Inserir produtos
execute_query("INSERT INTO Produtos (nome_produto, preco) VALUES ('iPhone 15 Pro Max', 5000.00)")
execute_query("INSERT INTO Produtos (nome_produto, preco) VALUES ('Samsung A15', 1500.00)")
execute_query("INSERT INTO Produtos (nome_produto, preco) VALUES ('Rog ally', 7000.00)")
execute_query("INSERT INTO Produtos (nome_produto, preco) VALUES ('Fishers (1KG)', 15.00)")

print('Dados inseridos com sucesso')

Dados inseridos com sucesso

In [47]:
execute_query("INSERT INTO Produtos (nome_produto, preco) VALUES ('Rog ally7', 7000.00)")

In [48]:
execute_query("INSERT INTO Produtos (nome_produto, preco) VALUES ('Pata de Coelho', 10.00)")
execute_query("INSERT INTO Produtos (nome_produto, preco) VALUES ('Notebook Lenovo', 3500.00)")
execute_query("INSERT INTO Produtos (nome_produto, preco) VALUES ('Livro de IA', 130.00)")
execute_query("INSERT INTO Produtos (nome_produto, preco) VALUES ('Livro de Redes - Douglas Rocha', 45.00)")

## Inserindo alguns pedidos

In [49]:
# Inserir pedidos
execute_query("INSERT INTO Pedidos (id_cliente) VALUES (11)") ##Pedido do Nivardo
execute_query("INSERT INTO Pedidos (id_cliente) VALUES (2)") ##Pedido do Renato

print('Dados inseridos com sucesso')

Dados inseridos com sucesso

In [53]:
execute_query("INSERT INTO Pedidos (id_cliente) VALUES (3)") ##Pedido da Natiara

## Inserindo detalhes dos pedidos

In [75]:
# Inserir detalhes do pedido
execute_query("INSERT INTO DetalhesPedidos (id_pedido, id_produto, quantidade) VALUES (1, 7, 1)") ##Nivardo, notebook
execute_query("INSERT INTO DetalhesPedidos (id_pedido, id_produto, quantidade) VALUES (2, 9, 1)") ##Renato, livro de redes
execute_query("INSERT INTO DetalhesPedidos (id_pedido, id_produto, quantidade) VALUES (4, 2, 1)") ## Natiara, samsumg

print('Dados inseridos com sucesso')

Dados inseridos com sucesso

In [55]:
def get_conn():
    conn = psycopg2.connect(
    dbname="auladb", #  nome do banco
    user="postgres",  # usuário de acesso
    password="userpassword",  # senha de acesso
    host="localhost", # endereço do servidor do banco de dados
    port="5432" # porta de acesso
    )

    return conn

# 2.5 Consultas SQL e pandas

Nesta seção, exploraremos consultas mais avançadas, usando junções e funções de agregação. Além disso, utilizaremos pandas para carregar os dados em DataFrames e realizar análises diretamente no Python.

In [77]:
conn = get_conn()

# 1. Consultar todos os clientes
query = "SELECT * FROM Clientes"
df_clientes = pd.read_sql(query, conn)
print("Clientes:")
print(df_clientes)

# 2. Consultar todos os produtos
query = "SELECT * FROM Produtos"
df_produtos = pd.read_sql(query, conn)
print("\nProdutos:")
print(df_produtos)

# 3. Listar todos os pedidos com detalhes
query = '''
SELECT p.id_pedido, c.nome AS cliente, pr.nome_produto, dp.quantidade, dp.quantidade * pr.preco AS total
FROM Pedidos p
JOIN Clientes c ON p.id_cliente = c.id_cliente
JOIN DetalhesPedidos dp ON p.id_pedido = dp.id_pedido
JOIN Produtos pr ON dp.id_produto = pr.id_produto
'''
df_pedidos = pd.read_sql(query, conn)
print("\nPedidos com Detalhes:")
print(df_pedidos)

# 4. Total de pedidos por cliente
query = '''
SELECT c.nome AS cliente, COUNT(p.id_pedido) AS total_pedidos, SUM(dp.quantidade * pr.preco) AS valor_total
FROM Clientes c
JOIN Pedidos p ON c.id_cliente = p.id_cliente
JOIN DetalhesPedidos dp ON p.id_pedido = dp.id_pedido
JOIN Produtos pr ON dp.id_produto = pr.id_produto
GROUP BY c.nome
ORDER BY valor_total DESC
'''
df_totais = pd.read_sql(query, conn)
print("\nTotal de Pedidos por Cliente:")
print(df_totais)

# 5. Produtos mais vendidos (análise de quantidade)
query = '''
SELECT pr.nome_produto, SUM(dp.quantidade) AS total_quantidade, SUM(dp.quantidade * pr.preco) AS receita_total
FROM Produtos pr
JOIN DetalhesPedidos dp ON pr.id_produto = dp.id_produto
GROUP BY pr.nome_produto
ORDER BY total_quantidade DESC
'''
df_produtos_vendidos = pd.read_sql(query, conn)
print("\nProdutos mais Vendidos:")
print(df_produtos_vendidos)

conn.close()

Clientes:
   id_cliente     nome                   email   telefone
0           2   Renato  renatostanz@alu.ufc.br  987654321
1           3  Natiara      natiarac@gmail.com  987654321
2          11  Nivardo       nivardo@gmail.com   12341344

Produtos:
   id_produto                    nome_produto   preco
0           1               iPhone 15 Pro Max  5000.0
1           2                     Samsung A15  1500.0
2           3                        Rog ally  7000.0
3           4                   Fishers (1KG)    15.0
4           5                       Rog ally7  7000.0
5           6                  Pata de Coelho    10.0
6           8                     Livro de IA   130.0
7           9  Livro de Redes - Douglas Rocha    45.0
8           7                 Notebook Lenovo  2800.0

Pedidos com Detalhes:
   id_pedido  cliente                    nome_produto  quantidade   total
0          1  Nivardo                 Notebook Lenovo           1  2800.0
1          2   Renato  Livro de Redes - Douglas Rocha           1    45.0
2          1  Nivardo                 Notebook Lenovo           1  2800.0
3          2   Renato  Livro de Redes - Douglas Rocha           1    45.0
4          4  Natiara                     Samsung A15           1  1500.0
5          1  Nivardo                 Notebook Lenovo           1  2800.0
6          2   Renato  Livro de Redes - Douglas Rocha           1    45.0
7          4  Natiara                     Samsung A15           1  1500.0

Total de Pedidos por Cliente:
   cliente  total_pedidos  valor_total
0  Nivardo              3       8400.0
1  Natiara              2       3000.0
2   Renato              3        135.0

Produtos mais Vendidos:
                     nome_produto  total_quantidade  receita_total
0  Livro de Redes - Douglas Rocha                 3          135.0
1                 Notebook Lenovo                 3         8400.0
2                     Samsung A15                 2         3000.0

## Explicação
1. **Pedidos com Detalhes:** Mostramos todas as informações sobre pedidos, clientes e produtos usando múltiplas junções.
2. **Total de Pedidos por Cliente:** Analisamos o número de pedidos e o valor total gasto por cada cliente.
3. **Produtos mais Vendidos:** Identificamos os produtos mais populares em termos de quantidade e receita.

In [78]:
mask_preco = df_pedidos['total'] > 1000
df_pedidos[mask_preco]

   id_pedido  cliente     nome_produto  quantidade   total
0          1  Nivardo  Notebook Lenovo           1  2800.0
2          1  Nivardo  Notebook Lenovo           1  2800.0
4          4  Natiara      Samsung A15           1  1500.0
5          1  Nivardo  Notebook Lenovo           1  2800.0
7          4  Natiara      Samsung A15           1  1500.0

In [80]:
df_pedidos.groupby(by='cliente').sum()['quantidade']

cliente
Natiara    2
Nivardo    3
Renato     3
Name: quantidade, dtype: int64

In [38]:
df_pedidos[df_pedidos['quantidade']>1] # algum pedido com a quantidade de um produto maior que 1

# Query semelhante da filtragem em SQL
# SELECT p.id_pedido, c.nome, pr.nome_produto, dp.quantidade, dp.quantidade * pr.preco AS total
# FROM Pedidos p
# JOIN Clientes c ON p.id_cliente = c.id_cliente
# JOIN DetalhesPedidos dp ON p.id_pedido = dp.id_pedido
# JOIN Produtos pr ON dp.id_produto = pr.id_produto
# WHERE dp.quantidade > 1

Empty DataFrame
Columns: [id_pedido, cliente, nome_produto, quantidade, total]
Index: []

In [62]:
df_clientes.query('nome == "Natiara"') # Filtrando a cliente Maria

   id_cliente     nome               email   telefone
2           3  Natiara  natiarac@gmail.com  987654321

In [63]:
df_filtrado = df_clientes.query("email.str.endswith('@gmail.com')", engine="python")
df_filtrado

    id_cliente     nome                      email        telefone
0            1    Joana  joanarabelo2013@gmail.com       123456789
2            3  Natiara         natiarac@gmail.com       987654321
3            4  Antonio  antvitoralmeida@gmail.com       987654321
4            5  Mariana      mariana6568@gmail.com       987654321
5            6     João             joao@gmail.com  (85) 123456879
6            9     Huan       lilzzzhuan@gmail.com   (85)123456879
7           11  Nivardo          nivardo@gmail.com        12341344
8           12     Yago     yhagocastro9@gmail.com       345252542
9           15  Nivardo         nivardo2@gmail.com        12341344
10          16     Yago    yhagocastro91@gmail.com       345252542

## Explicação do Comando: `df.query("email.str.endswith('.com')", engine="python")`

O comando é utilizado para filtrar um DataFrame `df`, retornando apenas as linhas onde o valor na coluna `email` termina com a string **".com"**. Aqui está uma explicação detalhada de cada parte:

---

## Desmembrando o Comando

1. **`query`**:
   - É um método do pandas que permite filtrar dados utilizando uma string com expressões condicionais de forma legível.
   - A string passada ao `query` define a condição a ser aplicada.

2. **`email`**:
   - Refere-se à coluna chamada `email` do DataFrame.

3. **`str.endswith('.com')`**:
   - `str` é um acessador de strings no pandas, que permite aplicar métodos de manipulação de texto em colunas do tipo string.
   - `endswith('.com')` retorna um **booleano (True ou False)** para cada valor da coluna, indicando se a string termina com `'.com'`.

4. **`engine="python"`**:
   - O pandas permite que você use dois "motores" para o método `query`: o padrão, que é baseado em expressões numéricas simples, e o Python, que é necessário para usar métodos de manipulação de strings ou outras operações mais complexas.
   - Aqui, como estamos usando `str.endswith`, que é um método do pandas baseado em Python, o `engine="python"` é necessário.

5. **`df.query`**:
   - Filtra o DataFrame com base na condição que avalia a coluna `email`.

---

## O Que Está Acontecendo?

- A expressão **`email.str.endswith('@gmail.com')`** verifica cada valor na coluna `email` do DataFrame.
- Para cada linha:
  - Se o valor da coluna `email` terminar com `'@gmail.com'`, a linha será incluída no DataFrame filtrado.
  - Caso contrário, será excluída.

---

# 2.6 Update e Remoção de Dados

Os comandos de **atualização** e **remoção** permitem modificar ou excluir registros no banco de dados. São especialmente úteis para manter os dados consistentes e atualizados.

## Comandos SQL
- `UPDATE`: Atualiza um ou mais campos em registros existentes.
- `DELETE`: Remove registros de uma tabela.

Vamos explorar esses comandos com exemplos práticos.

In [64]:
# 1. Atualizar o e-mail de um cliente

conn = get_conn()

# Consultar os dados atualizados
query = "SELECT * FROM Clientes"
df_clientes_antes = pd.read_sql(query, conn)
print("\nClientes antes atualização:")
print(df_clientes_antes)

cursor = conn.cursor()
execute_query("UPDATE Clientes SET email = 'joana@outlook.com' WHERE nome = 'Joana'")
conn.commit()

# Consultar os dados atualizados
query = "SELECT * FROM Clientes"
df_clientes_atualizados = pd.read_sql(query, conn)
print("\nClientes após atualização:")
print(df_clientes_atualizados)
conn.close()

Clientes antes atualização:
    id_cliente     nome                      email        telefone
0            1    Joana  joanarabelo2013@gmail.com       123456789
1            2   Renato     renatostanz@alu.ufc.br       987654321
2            3  Natiara         natiarac@gmail.com       987654321
3            4  Antonio  antvitoralmeida@gmail.com       987654321
4            5  Mariana      mariana6568@gmail.com       987654321
5            6     João             joao@gmail.com  (85) 123456879
6            9     Huan       lilzzzhuan@gmail.com   (85)123456879
7           11  Nivardo          nivardo@gmail.com        12341344
8           12     Yago     yhagocastro9@gmail.com       345252542
9           15  Nivardo         nivardo2@gmail.com        12341344
10          16     Yago    yhagocastro91@gmail.com       345252542

Clientes após atualização:
    id_cliente     nome                      email        telefone
0            2   Renato     renatostanz@alu.ufc.br       987654321
1            3  Natiara         natiarac@gmail.com       987654321
2            4  Antonio  antvitoralmeida@gmail.com       987654321
3            5  Mariana      mariana6568@gmail.com       987654321
4            6     João             joao@gmail.com  (85) 123456879
5            9     Huan       lilzzzhuan@gmail.com   (85)123456879
6           11  Nivardo          nivardo@gmail.com        12341344
7           12     Yago     yhagocastro9@gmail.com       345252542
8           15  Nivardo         nivardo2@gmail.com        12341344
9           16     Yago    yhagocastro91@gmail.com       345252542
10           1    Joana          joana@outlook.com       123456789

## Atualização na tabela de produtos

In [65]:
conn = get_conn()

# Consultar os produtos antes
query = "SELECT * FROM Produtos"
df_produtos_antes = pd.read_sql(query, conn)
print("\nProdutos antes da atualização de preço:")
print(df_produtos_antes)

# 2. Atualizar o preço de um produto
cursor = conn.cursor()
execute_query("UPDATE Produtos SET preco = preco * 0.8 WHERE nome_produto = 'Notebook Lenovo'")
conn.commit()

# Consultar os produtos atualizados
query = "SELECT * FROM Produtos"
df_produtos_atualizados = pd.read_sql(query, conn)
print("\nProdutos após atualização de preço:")
print(df_produtos_atualizados)

conn.close()

Produtos antes da atualização de preço:
   id_produto                    nome_produto   preco
0           1               iPhone 15 Pro Max  5000.0
1           2                     Samsung A15  1500.0
2           3                        Rog ally  7000.0
3           4                   Fishers (1KG)    15.0
4           5                       Rog ally7  7000.0
5           6                  Pata de Coelho    10.0
6           7                 Notebook Lenovo  3500.0
7           8                     Livro de IA   130.0
8           9  Livro de Redes - Douglas Rocha    45.0

Produtos após atualização de preço:
   id_produto                    nome_produto   preco
0           1               iPhone 15 Pro Max  5000.0
1           2                     Samsung A15  1500.0
2           3                        Rog ally  7000.0
3           4                   Fishers (1KG)    15.0
4           5                       Rog ally7  7000.0
5           6                  Pata de Coelho    10.0
6           8                     Livro de IA   130.0
7           9  Livro de Redes - Douglas Rocha    45.0
8           7                 Notebook Lenovo  2800.0

## Deletando informações na tabela de pedidos... Restrição de integridade

In [66]:
conn = get_conn()

# Consultar os pedidos após exclusão
query = "SELECT * FROM Pedidos"
df_pedidos_antes_removidos = pd.read_sql(query, conn)
print("\nPedidos após remoção:")
print(df_pedidos_antes_removidos)

# 3. Excluir um pedido específico
cursor = conn.cursor()
execute_query("DELETE FROM Pedidos WHERE id_pedido = 3")
conn.commit()

# Consultar os pedidos após exclusão
query = "SELECT * FROM Pedidos"
df_pedidos_removidos = pd.read_sql(query, conn)
print("\nPedidos após remoção:")
print(df_pedidos_removidos)

conn.close()

Pedidos após remoção:
   id_pedido  id_cliente data_pedido
0          1          11  2024-11-28
1          2           2  2024-11-28
2          3           2  2024-11-28
3          4           3  2024-11-28

Pedidos após remoção:
   id_pedido  id_cliente data_pedido
0          1          11  2024-11-28
1          2           2  2024-11-28
2          4           3  2024-11-28

In [67]:
execute_query("DELETE FROM Pedidos WHERE id_pedido = 10")

In [68]:
conn = get_conn()

cursor = conn.cursor()

# 4. Excluir todos os clientes sem pedidos
execute_query('''
DELETE FROM Clientes
WHERE id_cliente NOT IN (SELECT DISTINCT id_cliente FROM Pedidos)
''')
conn.commit()

# Consultar clientes após remoção
query = "SELECT * FROM Clientes"
df_clientes_final = pd.read_sql(query, conn)
print("\nClientes após remoção de inativos:")
print(df_clientes_final)

conn.close()

Clientes após remoção de inativos:
   id_cliente     nome                   email   telefone
0           2   Renato  renatostanz@alu.ufc.br  987654321
1           3  Natiara      natiarac@gmail.com  987654321
2          11  Nivardo       nivardo@gmail.com   12341344

## Explicação
1. Atualizamos o e-mail de um cliente e o preço de um produto.
2. Excluímos um pedido específico.
3. Removemos clientes que não possuem pedidos associados, garantindo um banco de dados mais limpo e eficiente.

### Observação:
Use sempre critérios claros no comando `DELETE` para evitar remoções acidentais.

# 3. Conceitos Importantes de Banco de Dados NoSQL Usando MongoDB

## O que é um Banco de Dados NoSQL?
- **NoSQL** refere-se a uma categoria de bancos de dados que não utiliza o modelo relacional tradicional.
- Projetados para lidar com grandes volumes de dados distribuídos e não estruturados.
- Exemplos de bancos de dados NoSQL incluem: MongoDB, Cassandra, CouchDB, Redis, entre outros.

---

## Tipos de Bancos de Dados NoSQL
1. **Orientados a Documentos**:
   - Armazenam dados no formato JSON ou BSON.
   - Exemplos: MongoDB, CouchDB.
   
   
2. **Chave-Valor**:
   - Cada item é armazenado como um par de chave e valor.
   - Exemplos: Redis, DynamoDB.
   
   
3. **Colunas Largas**:
   - Armazenam dados em tabelas, mas permitem flexibilidade no número de colunas por linha.
   - Exemplos: Cassandra, HBase.
   
   
4. **Grafos**:
   - Armazenam dados na forma de nós e arestas, ideais para representar relações complexas.
   - Exemplos: Neo4j, ArangoDB.

---

## 3.1 Principais Conceitos no MongoDB

### 1. **Coleções**
- Conjuntos de documentos, equivalentes a tabelas em bancos de dados relacionais.
- Não exigem um esquema fixo, permitindo flexibilidade nos dados armazenados.

### 2. **Documentos**
- Unidade básica de dados no MongoDB.
- Representados em JSON ou BSON (Binária).
- Contêm pares de chave-valor e podem ser aninhados (ou seja, conter subdocumentos).

Exemplo de Documento:
```json
{
  "nome": "João",
  "idade": 30,
  "enderecos": [
    { "rua": "Rua A", "cidade": "São Paulo" },
    { "rua": "Rua B", "cidade": "Rio de Janeiro" }
  ]
}

## 3.2 Tutorial: Usando MongoDB com Python e Pandas

## Pré-requisitos

Antes de começar, certifique-se de que você possui as bibliotecas necessárias instaladas:

1. Instale o driver do MongoDB para Python:
   ```bash
   pip install pymongo

## Mini Tutorial: Instalação do MongoDB

## O que é MongoDB?
MongoDB é um banco de dados NoSQL, orientado a documentos, que armazena dados no formato JSON/BSON. É amplamente utilizado por sua flexibilidade e escalabilidade.

---

## Passo a Passo para Instalação

### 1. Baixando o MongoDB
1. Acesse o site oficial do MongoDB: [https://www.mongodb.com/try/download/community](https://www.mongodb.com/try/download/community).
2. Escolha sua plataforma (Windows, macOS, Linux).
3. Baixe a versão **Community Server**.

---

### 2. Instalando no Windows
1. Execute o instalador baixado.
2. Siga as etapas do assistente de instalação:
   - Aceite os termos de licença.
   - Escolha a opção **Complete**.
   - Marque a opção para instalar o **MongoDB Compass** (interface gráfica opcional).
3. Após a instalação, adicione o diretório `bin` do MongoDB ao **PATH** do sistema:
   - Vá até `Configurações > Sistema > Sobre > Configurações avançadas do sistema`.
   - Adicione `C:\Program Files\MongoDB\Server\<versão>\bin` ao PATH.
4. Abra o Prompt de Comando e verifique a instalação:
   ```bash
   mongod --version

5. Ferramentas Adicionais
- MongoDB Compass: Interface gráfica para gerenciar seus bancos de dados.
- MongoDB Atlas: Serviço de MongoDB na nuvem.

In [14]:
!pip install pymongo

Collecting pymongo
  Downloading pymongo-4.10.1-cp39-cp39-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (1.2 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.2/1.2 MB 15.5 MB/s eta 0:00:0000:0100:01
Collecting dnspython<3.0.0,>=1.16.0
  Downloading dnspython-2.7.0-py3-none-any.whl (313 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 313.6/313.6 kB 19.0 MB/s eta 0:00:00
Installing collected packages: dnspython, pymongo
Successfully installed dnspython-2.7.0 pymongo-4.10.1

## 3.3 Conectando ao MongoDB

O primeiro passo é estabelecer uma conexão com o servidor MongoDB.

In [81]:
from pymongo import MongoClient

# Conecte ao servidor MongoDB
client = MongoClient('mongodb://localhost:27017/')

# Crie ou conecte-se ao banco de dados
db = client['exemplo_db']

# Crie ou conecte-se à coleção
collection = db['exemplo_colecao']

print("Conexão com o MongoDB estabelecida!")

Conexão com o MongoDB estabelecida!

### Inserindo Dados

#### Inserir um único documento

In [82]:
# Inserir um único documento
documento = {"nome": "Nivardo", "idade": 30, "cidade": "Fortaleza"}
collection.insert_one(documento)
print("Documento inserido com sucesso!")

Documento inserido com sucesso!

#### Inserir múltiplos documento

In [83]:
# Inserir múltiplos documentos
documentos = [
    {"nome": "Natiara", "idade": 25, "cidade": "Rio de Janeiro"},
    {"nome": "mariana", "idade": 35, "cidade": "Belo Horizonte"},
    {"nome": "Antonio", "idade": 28, "cidade": "Fortaleza"}
]
collection.insert_many(documentos)
print("Múltiplos documentos inseridos com sucesso!")

Múltiplos documentos inseridos com sucesso!

### Selecionando Dados

#### Selecionar todos os documentos

In [85]:
import pandas as pd

# Buscar todos os documentos
resultados = collection.find()

# Converter os resultados em um DataFrame do pandas
df = pd.DataFrame(resultados)
df

                         _id      nome  idade          cidade
0   674890f8741ddf4ca663dfbb      João     30        Curitiba
1   674890fa741ddf4ca663dfbd     Pedro     35  Belo Horizonte
2   674890fd741ddf4ca663dfc0     Pedro     35  Belo Horizonte
3   674890fd741ddf4ca663dfc2    Carlos     40        Brasília
4   674890fd741ddf4ca663dfc3  Fernanda     32        Salvador
5   6748945c741ddf4ca663dfc4      João     30       São Paulo
6   674894a0741ddf4ca663dfc5    Carlos     40        Brasília
7   674894a0741ddf4ca663dfc6  Fernanda     32        Salvador
8   6748b37ad59003f746df97e0   Nivardo     30       Fortaleza
9   6748b3a0d59003f746df97e1   Natiara     25  Rio de Janeiro
10  6748b3a0d59003f746df97e2   mariana     35  Belo Horizonte
11  6748b3a0d59003f746df97e3   Antonio     28       Fortaleza

#### Selecionar com critérios (filtro)

In [87]:
# Buscar documentos com idade maior que 30:

resultados = collection.find({"idade": {"$gt": 20}}) # greater than ($gt) -> Maior que
df_filtrado = pd.DataFrame(resultados)
df_filtrado

                         _id      nome  idade          cidade
0   674890f8741ddf4ca663dfbb      João     30        Curitiba
1   674890fa741ddf4ca663dfbd     Pedro     35  Belo Horizonte
2   674890fd741ddf4ca663dfc0     Pedro     35  Belo Horizonte
3   674890fd741ddf4ca663dfc2    Carlos     40        Brasília
4   674890fd741ddf4ca663dfc3  Fernanda     32        Salvador
5   6748945c741ddf4ca663dfc4      João     30       São Paulo
6   674894a0741ddf4ca663dfc5    Carlos     40        Brasília
7   674894a0741ddf4ca663dfc6  Fernanda     32        Salvador
8   6748b37ad59003f746df97e0   Nivardo     30       Fortaleza
9   6748b3a0d59003f746df97e1   Natiara     25  Rio de Janeiro
10  6748b3a0d59003f746df97e2   mariana     35  Belo Horizonte
11  6748b3a0d59003f746df97e3   Antonio     28       Fortaleza

In [89]:
# Buscar documentos onde a idade seja menor ou igual a 32:

resultados = collection.find({"idade": {"$lte": 32}})
df = pd.DataFrame(resultados)
df

                        _id      nome  idade          cidade
0  674890f8741ddf4ca663dfbb      João     30        Curitiba
1  674890fd741ddf4ca663dfc3  Fernanda     32        Salvador
2  6748945c741ddf4ca663dfc4      João     30       São Paulo
3  674894a0741ddf4ca663dfc6  Fernanda     32        Salvador
4  6748b37ad59003f746df97e0   Nivardo     30       Fortaleza
5  6748b3a0d59003f746df97e1   Natiara     25  Rio de Janeiro
6  6748b3a0d59003f746df97e3   Antonio     28       Fortaleza

In [92]:
# Buscar documentos onde a cidade seja "Salvador":

resultados = collection.find({"cidade": "Rio de Janeiro"})
df = pd.DataFrame(resultados)
df

                        _id     nome  idade          cidade
0  6748b3a0d59003f746df97e1  Natiara     25  Rio de Janeiro

In [96]:
# Buscar documentos onde a idade seja 28 e a cidade seja "Fortaleza":

resultados = collection.find({"idade": 25, "cidade": "Rio de Janeiro"})
df = pd.DataFrame(resultados)
df

                        _id     nome  idade          cidade
0  6748b3a0d59003f746df97e1  Natiara     25  Rio de Janeiro

In [97]:
# Buscar documentos onde a idade seja 30 ou a cidade seja "Rio de Janeiro":

resultados = collection.find({"$or": [{"idade": 30}, {"cidade": "Rio de Janeiro"}]})
df = pd.DataFrame(resultados)
df

                        _id     nome  idade          cidade
0  674890f8741ddf4ca663dfbb     João     30        Curitiba
1  6748945c741ddf4ca663dfc4     João     30       São Paulo
2  6748b37ad59003f746df97e0  Nivardo     30       Fortaleza
3  6748b3a0d59003f746df97e1  Natiara     25  Rio de Janeiro

In [98]:
# Buscar documentos onde a idade seja maior que 25 e a cidade seja "São Paulo":
resultados = collection.find({"$and": [{"idade": {"$gt": 25}}, {"cidade": "São Paulo"}]})
df = pd.DataFrame(resultados)
df

                        _id  nome  idade     cidade
0  6748945c741ddf4ca663dfc4  João     30  São Paulo

In [99]:
# Buscar documentos que não possuem o campo idade:
resultados = collection.find({"idade": {"$exists": False}})
df = pd.DataFrame(resultados)
df

Empty DataFrame
Columns: []
Index: []

In [101]:
# Buscar documentos, retornando apenas os campos nome e cidade:
resultados = collection.find({}, {"_id": 0, "nome": 1, "cidade": 1})
df = pd.DataFrame(resultados)
df

        nome          cidade
0       João        Curitiba
1      Pedro  Belo Horizonte
2      Pedro  Belo Horizonte
3     Carlos        Brasília
4   Fernanda        Salvador
5       João       São Paulo
6     Carlos        Brasília
7   Fernanda        Salvador
8    Nivardo       Fortaleza
9    Natiara  Rio de Janeiro
10   mariana  Belo Horizonte
11   Antonio       Fortaleza

### Atualizando Dados

#### Atualizar um único documento

In [102]:
# Atualizar a cidade de um documento com nome "João"
collection.update_one({"nome": "Natiara"}, {"$set": {"cidade": "Florianópolis"}})
print("Documento atualizado com sucesso!")

Documento atualizado com sucesso!

#### Atualizar múltiplos documentos

In [103]:
# Atualizar a idade para 29 para todos com a cidade "Fortaleza"
collection.update_many({"cidade": "Fortaleza"}, {"$set": {"idade": 29}})
print("Múltiplos documentos atualizados com sucesso!")

Múltiplos documentos atualizados com sucesso!

### Removendo Dados

#### Remover um único documento

In [104]:
# Remover o documento com nome "Maria"
collection.delete_one({"nome": "Nivardo"})
print("Documento removido com sucesso!")

Documento removido com sucesso!

#### Remover múltiplos documentos

In [105]:
# Remover todos os documentos com idade menor que 30
collection.delete_many({"idade": {"$lt": 30}})
print("Múltiplos documentos removidos com sucesso!")

Múltiplos documentos removidos com sucesso!

### Integração com Pandas
#### Ler dados diretamente do MongoDB em um DataFrame

In [107]:
# Buscar todos os documentos
resultados = collection.find()

# Converter para DataFrame
df = pd.DataFrame(resultados)

# Exibir o DataFrame
df

                        _id      nome  idade          cidade
0  674890f8741ddf4ca663dfbb      João     30        Curitiba
1  674890fa741ddf4ca663dfbd     Pedro     35  Belo Horizonte
2  674890fd741ddf4ca663dfc0     Pedro     35  Belo Horizonte
3  674890fd741ddf4ca663dfc2    Carlos     40        Brasília
4  674890fd741ddf4ca663dfc3  Fernanda     32        Salvador
5  6748945c741ddf4ca663dfc4      João     30       São Paulo
6  674894a0741ddf4ca663dfc5    Carlos     40        Brasília
7  674894a0741ddf4ca663dfc6  Fernanda     32        Salvador
8  6748b3a0d59003f746df97e2   mariana     35  Belo Horizonte

In [110]:
mask_idade = df['idade'] > 30
df[mask_idade]

                        _id      nome  idade          cidade
1  674890fa741ddf4ca663dfbd     Pedro     35  Belo Horizonte
2  674890fd741ddf4ca663dfc0     Pedro     35  Belo Horizonte
3  674890fd741ddf4ca663dfc2    Carlos     40        Brasília
4  674890fd741ddf4ca663dfc3  Fernanda     32        Salvador
6  674894a0741ddf4ca663dfc5    Carlos     40        Brasília
7  674894a0741ddf4ca663dfc6  Fernanda     32        Salvador
8  6748b3a0d59003f746df97e2   mariana     35  Belo Horizonte

#### Inserir dados de um DataFrame no MongoDB

In [71]:
# Criar um DataFrame
novos_dados = pd.DataFrame({
    "nome": ["Carlos", "Fernanda"],
    "idade": [40, 32],
    "cidade": ["Brasília", "Salvador"]
})

# Inserir cada linha do DataFrame como um documento no MongoDB
collection.insert_many(novos_dados.to_dict('records'))
print("Dados do DataFrame inseridos no MongoDB com sucesso!")

Dados do DataFrame inseridos no MongoDB com sucesso!

## 4. Comparação Resumida

| Aspecto                  | SQL                             | NoSQL                         |
|--------------------------|---------------------------------|-------------------------------|
| **Estrutura de Dados**   | Tabelas fixas, esquema rígido  | Flexível (documentos, grafos, etc.) |
| **Consistência**         | ACID (forte)                   | Eventual          |
| **Escalabilidade**       | Vertical                       | Horizontal                    |
| **Consultas Complexas**  | Suporte robusto (joins)        | Limitado                      |
| **Facilidade de Mudança**| Difícil (alterar esquema)      | Fácil                         |
| **Volume de Dados**      | Moderado                       | Altamente escalável           |

---

#### Estrutura de Dados
- **SQL**: Utiliza tabelas com esquemas rígidos. Cada tabela tem colunas predefinidas e os dados inseridos devem seguir esse esquema. Isso garante organização, mas dificulta mudanças rápidas.
- **NoSQL**: Oferece maior flexibilidade, permitindo diferentes formatos de dados, como documentos (JSON), chave-valor, grafos ou colunas. Ideal para cenários onde o formato dos dados muda frequentemente.

#### Consistência
- **SQL**: Segue o modelo ACID, garantindo que as transações sejam completamente consistentes. Por exemplo, em um sistema bancário, uma transferência entre contas não pode ser confirmada até que ambas as alterações (débito e crédito) sejam concluídas.
- **NoSQL**: Prioriza disponibilidade e desempenho, muitas vezes adotando consistência eventual. Os dados podem levar algum tempo para sincronizar em todos os nós do sistema, o que pode ser aceitável em sistemas como redes sociais.

#### Escalabilidade
- **SQL**: Escalabilidade vertical, ou seja, para lidar com mais dados ou usuários, é necessário investir em hardware mais potente (e.g., mais memória, processadores).
- **NoSQL**: Escalabilidade horizontal, que permite adicionar mais servidores para distribuir a carga. Isso torna o NoSQL mais adequado para grandes volumes de dados e tráfego.

#### Consultas Complexas
- **SQL**: Excelente para operações avançadas, como junções (joins) entre várias tabelas, agregações e análises complexas.
- **NoSQL**: Não suporta operações complexas com a mesma facilidade. Algumas consultas avançadas podem ser difíceis ou até impossíveis sem criar lógica extra na aplicação.

#### Facilidade de Mudança
- **SQL**: Esquema rígido dificulta mudanças. Alterar a estrutura de uma tabela existente (e.g., adicionar uma nova coluna) pode ser demorado e causar interrupções no sistema.
- **NoSQL**: Esquema flexível permite adicionar ou alterar atributos nos dados sem impactos significativos, tornando-o mais adaptável a mudanças frequentes.

#### Volume de Dados
- **SQL**: Projetado para volumes moderados, como bancos de dados corporativos ou aplicativos de médio porte. O desempenho pode se degradar em cenários com bilhões de registros.
- **NoSQL**: Ideal para lidar com grandes volumes de dados, como logs, dados de sensores IoT ou redes sociais. Sua arquitetura distribuída facilita o gerenciamento de enormes quantidades de informações.

### 4.1 Quando Usar Cada Um

#### SQL
- Quando a **consistência e integridade** dos dados são cruciais.
- Em sistemas que têm **dados bem estruturados** e um esquema fixo.
- Quando há necessidade de **consultas complexas**.

#### NoSQL
- Quando se lida com **grandes volumes de dados** ou dados em constante mudança.
- Quando a **escalabilidade horizontal** é essencial.
- Para armazenar dados **não estruturados** ou semi-estruturados.